_Rarzrabotki/Rarus/USO2/Catalogs/ТипыТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ТипыТранспортныхСредств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоподъемностьВТоннах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьВКубическихМетрах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидТС</Name>
					<Comment>Вид ТС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатСамосвал</Name>
					<Comment>Является самосвалом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатПолезныйРазмерВысота</Name>
					<Comment>Полезная высота</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатПолезныйРазмерДлина</Name>
					<Comment>Полезная длина</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатПолезныйРазмерШирина</Name>
					<Comment>Полезная ширина</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатТипКузова</Name>
					<Comment>Тип кузова</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonForms/уатФормаПодбораТиповТСИзКлассификатора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗакрыватьПриВыборе = Ложь;
	ИмяМакета = "уатМакетКлассификатораТиповТСОН";
	ЗаполнитьТаблицуТиповТС(ИмяМакета);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокТиповТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборВСпискеТиповТС(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяМакетаПриИзменении(Элемент)
	ЗаполнитьТаблицуТиповТС(ИмяМакета);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВыполнить()
	
	ОбработатьВыборВСпискеТиповТС();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуТиповТС(ИмяМакета)
	
	ТипыТС.Очистить();
	
	// Заполняет список типов кузовов из макета.
	МакетДанных = ПолучитьОбщийМакет(ИмяМакета);
	КолСтрок = МакетДанных.ВысотаТаблицы;
	Для сч = 1 По КолСтрок Цикл
		НоваяСтрока = ТипыТС.Добавить();
		НоваяСтрока.Группа = МакетДанных.Область(сч,1,сч,1).Текст;
		НоваяСтрока.Наименование = МакетДанных.Область(сч,2,сч,2).Текст;
		ВидТСНаименование = МакетДанных.Область(сч,3,сч,3).Текст;
		ВидТСМетаданные = Метаданные.Перечисления.уатВидыТС.ЗначенияПеречисления.Найти(ВидТСНаименование);
		Если ВидТСМетаданные <> Неопределено Тогда
			НоваяСтрока.уатВидТС = Перечисления.уатВидыТС[ВидТСМетаданные.Имя];
		КонецЕсли;
		
		НоваяСтрока.уатСамосвал = МакетДанных.Область(сч,4,сч,4).Текст;
		НоваяСтрока.уатПолезныйРазмерДлина = МакетДанных.Область(сч,5,сч,5).Текст;
		НоваяСтрока.уатПолезныйРазмерШирина = МакетДанных.Область(сч,6,сч,6).Текст;
		НоваяСтрока.уатПолезныйРазмерВысота = МакетДанных.Область(сч,7,сч,7).Текст;
		НоваяСтрока.ВместимостьВКубическихМетрах = МакетДанных.Область(сч,8,сч,8).Текст;
		НоваяСтрока.ГрузоподъемностьВТоннах = МакетДанных.Область(сч,9,сч,9).Текст;
		НоваяСтрока.ТипКузоваНаименование = МакетДанных.Область(сч,10,сч,10).Текст;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СохранитьВыбранныеСтроки(Знач ВыбранныеСтроки)
	
	ТекущаяСсылка = Неопределено;
	СправочникКузовов = Справочники.уатТипыКузовов;
	
	Для каждого НомерСтроки Из ВыбранныеСтроки Цикл
		ТекущиеДанные = ТипыТС.НайтиПоИдентификатору(НомерСтроки);
		
		//тГруппа = ТекущиеДанные.Группа;
		тНаименование = ТекущиеДанные.Наименование;
		
		СтрокаВБазе = Справочники.ТипыТранспортныхСредств.НайтиПоНаименованию(СокрЛП(тНаименование), Истина);
		// Либо такой элемент в справочнике уже есть
		Если ЗначениеЗаполнено(СтрокаВБазе) Тогда
			Если НомерСтроки = Элементы.СписокТиповТС.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
				ТекущаяСсылка = СтрокаВБазе;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		// Либо этот элемент нужно создать
		ТипТС = Справочники.ТипыТранспортныхСредств.СоздатьЭлемент();
		
		// Находим тип кузова по наименованию. Если не находим - создаем новый элемент справочника уатТипыКузовов
		ТипКузоваНаименование = ТекущиеДанные.ТипКузоваНаименование;
		Если ТипКузоваНаименование <> "" Тогда
			ТипКузоваИзСправочника = СправочникКузовов.НайтиПоНаименованию(СокрЛП(ТипКузоваНаименование), Истина);
			Если ТипКузоваИзСправочника <> Неопределено И Не ТипКузоваИзСправочника.Пустая() Тогда
				ТипТС.уатТипКузова = ТипКузоваИзСправочника;
			ИначеЕсли ТипКузоваИзСправочника.Пустая() Тогда
				ТипКузова = СправочникКузовов.СоздатьЭлемент();
				ТипКузова.Наименование = ТипКузоваНаименование;
				ТипКузова.Записать();
				ТипТС.уатТипКузова = ТипКузова.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
	    ЗаполнитьЗначенияСвойств(ТипТС, ТекущиеДанные);
		ТипТС.Записать();
	
		Если НомерСтроки = Элементы.СписокТиповТС.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
			ТекущаяСсылка = ТипТС.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущаяСсылка;

КонецФункции

&НаКлиенте
Процедура ОбработатьВыборВСпискеТиповТС(СтандартнаяОбработка = Неопределено)
		
	// Добавление элемента справочника и вывод результата пользователю.
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСсылка = СохранитьВыбранныеСтроки(Элементы.СписокТиповТС.ВыделенныеСтроки);
	
	// ОповеститьОВыборе(ТекущаяСсылка);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Типы кузовов добавлены.'"), , , БиблиотекаКартинок.Информация32);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
